/* Nes::RESULT_ERR_GENERIC */
"An unspecified error occurred." = "An unspecified error occurred.";

/* Nes::RESULT_ERR_CORRUPT_FILE */
"Corrupted file." = "Corrupted file.";

/* Nes::RESULT_ERR_MISSING_BIOS */
"FDS BIOS not found." = "FDS BIOS not found.";

/* Nes::RESULT_ERR_INVALID_FILE */
"Invalid file format." = "Invalid file format.";

/* Nes::RESULT_WARN_BAD_DUMP */
"This is a known bad dump." = "This is a known bad dump.";

/* Nes::RESULT_WARN_ENCRYPTED_ROM */
"This ROM is encrypted." = "This ROM is encrypted.";

/* Nes::IMAGE_DATABASE_LOAD_ERROR */
"Unable to load image database." = "Unable to load image database.";

/* Nes::RESULT_ERR_UNSUPPORTED_VSSYSTEM */
"Unsupported game." = "Unsupported game.";

/* Nes::RESULT_ERR_UNSUPPORTED_MAPPER */
"Unsupported mapper." = "Unsupported mapper.";

/* Nes::RESULT_ERR_UNSUPPORTED_SOUND_CHIP */
"Unsupported sound chip." = "Unsupported sound chip.";

